نامه 047-وصیت به حسن و حسین 
پندهای جاودانه 
شما را به ترس از خدا سفارش می كنم به دنیا روی نیاورید، گرچه به سراغ شما آید، و بر آنچه از دنیا از دست می دهید اندوهناك مباشید، حق را بگویید، و برای پاداش الهی عمل كنید. دشمن ستمگر و یاور ستمدیده باشید. شما را، و تمام فرزندان و خاندانم را، و كسانی را كه این وصیت به آنها می رسد، به ترس از خدا، و نظم در امور زندگی، و ایجاد صلح و آشتی در میانتان سفارش می كنم، زیرا من از جد شما پیامبر (ص) شنیدم كه می گفت: (اصلاح دادن بین مردم از نماز و روزه یكسان برتر است.) 
خدا را! خدا را! درباره یتیمان، نكند آنان گاهی سیر و گاه گرسنه بمانند، و حقوقشان ضایع گردد. خدا را! خدا را! درباره همسایگان، حقوقشان را رعایت كنید كه وصیت پیامبر (ص) شماست، همواره به خوش رفتاری با همسایگان سفارش می كرد تا آنجا كه گمان بردیم برای آنان ارثی معین خواهد كرد. 
خدا را! خدا را! درباره قرآن، مبادا دیگران در عمل كردن به دستوراتش از شما پیشی گیرند. 
خدا را! خدا را! درباره نماز همانا كه ستون دین شماست. 
خدا را! خدا را! درباره خانه خدا، تا هستید آن را خالی مگذارید، زیرا اگر كعبه خالی شود مهلت داده نمی شوید. 
خدا را! خدا را! درباره جهاد با اموال و جانها و زبانهای خویش در راه خدا. بر شما باد به پیوستن با یكدیگر، و بخشش همدیگر، مبادا از هم روی گردانید، و پیوند دوستی را از بین ببرید، امر به معروف و نهی از منكر را ترك كنید كه بدان شما بر شما مسلط می گرداند، آنگاه هر چه خدا را بخوانید جواب ندهد. (سپس فرمود). 
سفارش به رعایت مقررات عدالت در قصاص 
ای فرزندان عبدالمطلب: مبادا پس از من دست به خون مسلمین فرو برید و بگویید: امیر مومنان كشته شد، بدانید جز كشنده من كسی دیگر نباید كشته شود. درست بنگرید! اگر من از ضربت او مردم، او را تنها یك ضربت بزنید، و دست و پا و دیگر اعضای او را مبرید، من از رسول خدا (ص) شنیدم كه فرمود: (بپرهیزید از بریدن اعضای مرده، هر چند سگ دیوانه باشد.)